
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если не Параметры.Ключ.Пустая() Тогда 
		ПроверитьНаличиеИсследованийПартиии(Параметры.Ключ);	
		ПроверитьНаличиеПаспортаКачества(Параметры.Ключ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеИсследованийПартиии(СсылкаНаПартию)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЛабораторныхИсследований.Регистратор.МоментВремени КАК РегистраторМоментВремени,
		|	ДанныеЛабораторныхИсследований.ЛабораторнаяПроба КАК ЛабораторнаяПроба,
		|	ДанныеЛабораторныхИсследований.Партия КАК Партия,
		|	ДанныеЛабораторныхИсследований.СодержаниеAu КАК СодержаниеAu,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиСодержанияAu КАК ПоказательТочностиСодержанияAu,
		|	ДанныеЛабораторныхИсследований.СодержаниеAg КАК СодержаниеAg,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиСодержанияAg КАК ПоказательТочностиСодержанияAg,
		|	ДанныеЛабораторныхИсследований.ПримесиSобщ КАК ПримесиSобщ,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПримесиSобщ КАК ПоказательТочностиПримесиSобщ,
		|	ДанныеЛабораторныхИсследований.ПримесиCорг КАК ПримесиCорг,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПримесиCорг КАК ПоказательТочностиПримесиCорг,
		|	ДанныеЛабораторныхИсследований.ПримесиAs КАК ПримесиAs,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПрмесиAs КАК ПоказательТочностиПримесиAs,
		|	ДанныеЛабораторныхИсследований.ПримесиFe КАК ПримесиFe,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПрмесиFe КАК ПоказательТочностиПримесиFe
		|ИЗ
		|	РегистрСведений.ДанныеЛабораторныхИсследований КАК ДанныеЛабораторныхИсследований
		|ГДЕ
		|	ДанныеЛабораторныхИсследований.Партия = &Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторМоментВремени";
	
	Запрос.УстановитьПараметр("Партия",СсылкаНаПартию);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ИсследованияПроведены = Истина;
		
		СодержаниеAu = ВыборкаДетальныеЗаписи.СодержаниеAu;
		ПоказательТочностиСодержанияAu = ВыборкаДетальныеЗаписи.ПоказательТочностиСодержанияAu;
		СодержаниеAg = ВыборкаДетальныеЗаписи.СодержаниеAg;
		ПоказательТочностиСодержанияAg = ВыборкаДетальныеЗаписи.ПоказательТочностиСодержанияAg;
		ПримесиSобщ = ВыборкаДетальныеЗаписи.ПримесиSобщ;
		ПоказательТочностиПрмесиSобщ = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиSобщ;
		ПримесиCорг = ВыборкаДетальныеЗаписи.ПримесиCорг;
		ПоказательТочностиПримесиCорг = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиCорг;
		ПримесиAs = ВыборкаДетальныеЗаписи.ПримесиAs;
		ПоказательТочностиПрмесиAs = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиAs;
		ПримесиFe  = ВыборкаДетальныеЗаписи.ПримесиFe;
		ПоказательТочностиПрмесиFe = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиFe;
		
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПроверитьНаличиеПаспортаКачества(СсылкаНаПартию)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПаспортовКачества.ПартияПродукции КАК ПартияПродукции,
		|	ДанныеПаспортовКачества.ПаспортКачества КАК ПаспортКачества
		|ИЗ
		|	РегистрСведений.ДанныеПаспортовКачества КАК ДанныеПаспортовКачества
		|ГДЕ
		|	ДанныеПаспортовКачества.ПартияПродукции = &ПартияПродукции";
	
	Запрос.УстановитьПараметр("ПартияПродукции", СсылкаНаПартию);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПаспортКачестваГотов = Истина;
		ПаспортКачества = ВыборкаДетальныеЗаписи.ПаспортКачества;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	Элементы.ГруппаСодержаниеДрагметалла.Видимость = ИсследованияПроведены;
	Элементы.ГруппаСодержаниеПримесей.Видимость = ИсследованияПроведены;
	Элементы.ГруппаПаспортКачества.Видимость = ПаспортКачестваГотов;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры
