
Процедура ОтключениеСеансовПользователей() Экспорт
	ВремяНачалаОграниченногоПодключения= Константы.НачалоСервисногоВремени.Получить();
	ВремяНачалаНеограниченногоПодключения= Константы.ОкончаниеСервисногоВремени.Получить();
	
	Если ВремяНачалаНеограниченногоПодключения = '00010101000000' ИЛИ
		ВремяНачалаОграниченногоПодключения = '00010101000000' Тогда 
		Возврат;
	КонецЕсли;
	# Если Клиент Тогда             
	// поскольку блокировка еще не установлена, то при входе в систему
	// для данного пользователя был подключен обработчик ожидания завершения работы.
	// Отключаем его. Так как для этого пользователя подключается специализированный обработчки ожидани
	// "ЗавершитьРаботуПользователей", который ориентирован на то, что данный пользователь
	// должен быть отключен последним.        
	
	ОтключитьОбработчикОжидания("КонтрольРежимаЗавершенияРаботыПользователей");
	ПодключитьОбработчикОжидания("ЗавершитьРаботуПользователей", 60);	
    # КонецЕсли 

	часН = Час(ВремяНачалаОграниченногоПодключения);
	минН = Минута(ВремяНачалаОграниченногоПодключения);
	секН = Секунда(ВремяНачалаОграниченногоПодключения);
	ГодН = Год(ТекущаяДата());
	МесН = Месяц(ТекущаяДата());
	ДеньН = День(ТекущаяДата());
	НачалоБлокировки = Дата(ГодН ,МесН, ДеньН, часН, минН, секН);
	
	часК = Час(ВремяНачалаНеограниченногоПодключения);
	минК = Минута(ВремяНачалаНеограниченногоПодключения);
	секК = Секунда(ВремяНачалаНеограниченногоПодключения);
	
	ГодК = Год(ТекущаяДата());
	МесК = Месяц(ТекущаяДата());
	ДеньК = День(ТекущаяДата());
	
	ОкончаниеБлокировки = Дата(ГодК ,МесК, ДеньК, часК, минК, секК);
		
	Сообщение = "Обслуживание ИБ";
	КодРазрешения = "111";
	
    // параметры блокировки
	Блокировка = Новый БлокировкаУстановкиСоединений;
	
	Блокировка.Начало 			= НачалоБлокировки;
	Блокировка.Конец  			= ОкончаниеБлокировки;
	Блокировка.Сообщение 		= Сообщение;
	Блокировка.Установлена 		= истина;
	Блокировка.КодРазрешения 	= КодРазрешения;	
	
	// установка блокировки соединений
	УстановитьБлокировкуУстановкиСоединений(Блокировка);
	
	Блокировка = ПолучитьБлокировкуУстановкиСоединений();
	

КонецПроцедуры
