
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация 		= Справочники.Организации.ОрганизацияПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);	
	Ответственный 		= Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщийВес = Продукция.Итог("ВесБруттоВлажный");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДанныеПодготовкиКПереработке.Записывать = Истина;
	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ДанныеПодготовкиКПереработке.Добавить();
		Движение.ТранспортировочноеМесто = ТекСтрокаПродукция.ТранспортировочноеМесто;
		Движение.НомерПартииПереработки = НомерПартииПереработки;
	КонецЦикла;
КонецПроцедуры
