
&НаКлиенте
Процедура ТипТранспортногоСредстваПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФОрмой()
	
	ЭтоАвтомобиль = Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.Автомобиль");
	Элементы.МодельТС.Видимость = ЭтоАвтомобиль;
	
	Если Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.Автомобиль") Тогда 
		Элементы.Номер.Заголовок = "Номер автомобиля";
		Элементы.СобственникТС.Заголовок = "Собственник автомобиля";
		
	ИначеЕсли Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.ЖелезнодорожныйПолувагон") Тогда 
		Элементы.Номер.Заголовок = "Номер вагона";
		Элементы.СобственникТС.Заголовок = "Собственник вагона";
	КонецЕсли;
	СформироватьИмяТС();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИмяТС()
	
	Если Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.Автомобиль") Тогда 
		Объект.Наименование = "Автомобиль г/н "+сокрЛП(Объект.НомерТС);
	ИначеЕсли Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.ЖелезнодорожныйПолувагон") Тогда 
		Объект.Наименование = "Вагон № "+сокрЛП(Объект.НомерТС);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьИмяТС();
КонецПроцедуры

	


