// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ПолучитьОсновнойДоговорКонтрагента(СсылкаНаКонтрагента) Экспорт 
	ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", СсылкаНаКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда 		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДоговорПоУмолчанию = ВыборкаДетальныеЗаписи.ссылка;
		КонецЕсли;
		Возврат ДоговорПоУмолчанию;
	Иначе
		Возврат ДоговорПоУмолчанию;
	КонецЕсли;
КонецФункции

