
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СкладПолучатель") Тогда 
		//устанавливам отбор по складу
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор, 
			"СкладПолучатель");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор,
			"СкладПолучатель",
			Параметры.СкладПолучатель,
			Неопределено,
			,
			Истина);
		
	КонецЕсли;
КонецПроцедуры
