
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Справочники.Контрагенты.ПолучитьОсновнойДоговорКонтрагента(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГрузоперевозчикПриИзмененииНаСервере()
	Объект.ДоговорГрузоперевозчика = Справочники.Контрагенты.ПолучитьОсновнойДоговорКонтрагента(Объект.Грузоперевозчик);
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозчикПриИзменении(Элемент)
	ГрузоперевозчикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПартияПродукцииПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ПартияПродукции) Тогда 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыпускПродукции.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВыпускПродукции КАК ВыпускПродукции
			|ГДЕ
			|	ВыпускПродукции.Партия = &Партия";
		
		Запрос.УстановитьПараметр("Партия", Объект.ПартияПродукции);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда 
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
				Объект.ДокументВыпуска = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеЛабораторныхИсследований.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеЛабораторныхИсследований КАК ПроведениеЛабораторныхИсследований
			|ГДЕ
			|	ПроведениеЛабораторныхИсследований.ПартияПродукции = &Партия";
		
		Запрос.УстановитьПараметр("Партия", Объект.ПартияПродукции);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда 
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
				Объект.ДокументИсследования = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартияПродукцииПриИзменении(Элемент)
	ПартияПродукцииПриИзмененииНаСервере();
КонецПроцедуры


