
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИнформациюОЗатаркеМестанаСервервере(ссылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗатаркиТранспортировочныхМест.ВесБруттоВлажный КАК ВесБруттоВлажный,
		|	ДанныеЗатаркиТранспортировочныхМест.ВесНеттоВлажный КАК ВесНеттоВлажный,
		|	ДанныеЗатаркиТранспортировочныхМест.Партия КАК Партия,
		|	ДанныеЗатаркиТранспортировочныхМест.НомерПломбы КАК НомерПломбы,
		|	ДанныеЗатаркиТранспортировочныхМест.Влажность КАК Влажность,
		|	ДанныеЗатаркиТранспортировочныхМест.НомерМеста КАК НомерМеста
		|ИЗ
		|	РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
		|ГДЕ
		|	ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто = &ТранспортировочноеМесто";
	
	Запрос.УстановитьПараметр("ТранспортировочноеМесто", ссылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		МестоЗагружено 		= Истина;
		Партия 				= ВыборкаДетальныеЗаписи.Партия;
		ВесБруттоВлажный 	= ВыборкаДетальныеЗаписи.ВесБруттоВлажный;
		ВесНеттоВлажный 	= ВыборкаДетальныеЗаписи.ВесНеттоВлажный;
		НомерПломбы 		= СокрЛП(ВыборкаДетальныеЗаписи.НомерПломбы);					
		Влажность 			= ВыборкаДетальныеЗаписи.Влажность;
		НомерМеста 			= ВыборкаДетальныеЗаписи.НомерМеста;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьИнформациюОПартииПереработкеНаСервере(ссылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПодготовкиКПереработке.НомерПартииПереработки КАК НомерПартииПереработки
		|ИЗ
		|	РегистрСведений.ДанныеПодготовкиКПереработке КАК ДанныеПодготовкиКПереработке
		|ГДЕ
		|	ДанныеПодготовкиКПереработке.ТранспортировочноеМесто = &ТранспортировочноеМесто";
	
	Запрос.УстановитьПараметр("ТранспортировочноеМесто", ссылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПартияПереработкиНазначена	= Истина;
		НомерПартииПереработки 		= ВыборкаДетальныеЗаписи.НомерПартииПереработки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если не Параметры.Ключ.Пустая() Тогда 
		ПолучитьИнформациюОЗатаркеМестанаСервервере(Параметры.Ключ);	
		ПолучитьИнформациюОПартииПереработкеНаСервере(Параметры.Ключ);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();	
КонецПроцедуры


&НаКлиенте
Процедура УправлениеФормой()
	Элементы.ГруппаЗатарка.Видимость = МестоЗагружено;
	
КонецПроцедуры

	

